In [1]:
import pandas as pd
import datetime as dt
import pyodbc as odbc
import os
import numpy as np

In [2]:
# Names the needed driver, server name, and database
driver_name='SQL Server'
server_name='10.0.1.218'
database='ritascoolnet_live'

In [3]:
#Creates the connection string
connection_string=f"""
DRIVER={{{driver_name}}};
SERVER={server_name};
DATABASE={database};
Trust_Connection=yes"""

In [4]:
#Creates the Connection to SQL Server
connection=odbc.connect(connection_string)
print(connection)

<pyodbc.Connection object at 0x000002B428821850>

In [5]:
# Queries the tables from SQL
# Reads in the Weekly Sales in 2023
sales23=pd.read_sql_query('''SELECT *
  FROM [ritas_bi].[dbo].[tmp_raw_plda]
  WHERE YEAR(StartDate)=2023
  ORDER BY Week DESC''',connection)
# Reads in the Weekly Sales in 2022
sales22=pd.read_sql_query('''SELECT *
  FROM [ritas_bi].[dbo].[tmp_raw_plda]
  WHERE YEAR(StartDate)=2022''',connection)
# Reads in Weekly Sales in 2021
sales21=pd.read_sql_query('''SELECT *
  FROM [ritas_bi].[dbo].[tmp_raw_pldb]
  WHERE YEAR(StartDate)=2021''',connection)

C:\Users\jharned\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
C:\Users\jharned\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
C:\Users\jharned\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [7]:
sales21.SalesMny.sum()

145273025.97809997

In [8]:
#Creates RitasID that we can use to combine Mobile and Satellite Shops sales to their Parent Shop
# sales21['RitasID']=sales21.ShopID.astype('str')
# sales21['RitasID']=sales21['RitasID'].str[-4:]
# sales21['RitasID']=sales21['RitasID'].astype('int')
#sorted(sales.RitasID.unique())

In [9]:
#Creates RitasID that we can use to combine Mobile and Satellite Shops sales to their Parent Shop
# sales22['RitasID']=sales22.ShopID.astype('str')
# sales22['RitasID']=sales22['RitasID'].str[-4:]
# sales22['RitasID']=sales22['RitasID'].astype('int')
#sorted(sales.RitasID.unique())

In [10]:
#Creates RitasID that we can use to combine Mobile and Satellite Shops sales to their Parent Shop
# sales23['RitasID']=sales23.ShopID.astype('str')
# sales23['RitasID']=sales23['RitasID'].str[-4:]
# sales23['RitasID']=sales23['RitasID'].astype('int')
# #sorted(sales.RitasID.unique())

In [6]:
sales22.SalesMny.sum()

157572192.98650002

In [8]:
sales21.SalesMny.sum()

145273025.9781

In [24]:
group_21=sales21[sales21.ShopID<10000].groupby('ShopID')[['SalesMny','Week']].agg({
    'SalesMny':'sum',
    'Week':['max','min','nunique']
})
group_21['Weeks_Open']=group_21.iloc[:,1]-group_21.iloc[:,2]+1

In [25]:
group_21

           SalesMny Week             Weeks_Open
                sum  max min nunique
ShopID
1       334092.8000   38   8      31         31
2       406201.2300   41   8      34         34
3       251030.7285   39   9      31         31
4       236673.6300   39   8      32         32
6       335120.4884   41   8      34         34
...             ...  ...  ..     ...        ...
1448     91480.8325   52  26      27         27
1450    262025.3055   52   8      45         45
1451    250358.4180   52   1      52         52
1453     45101.6460   52  39      14         14
1462       109.7300   47  46       2          2

[524 rows x 5 columns]

In [26]:
group_22=sales22[sales22.ShopID<10000].groupby('ShopID')[['SalesMny','Week']].agg({
    'SalesMny':'sum',
    'Week':['max','min','nunique']
})
group_22['Weeks_Open']=group_22.iloc[:,1]-group_22.iloc[:,2]+1

In [27]:
group_22

           SalesMny Week             Weeks_Open
                sum  max min nunique
ShopID
1       372821.1790   43   8      33         36
2       499034.9450   41   9      33         33
3       256647.8307   39   6      33         34
4       263541.0212   39   8      32         32
6       378659.3401   41   8      34         34
...             ...  ...  ..     ...        ...
1476    142824.8085   45  25      21         21
1478    180693.1500   52  11      42         42
1479     44901.2958   49  40      10         10
1482    220384.3307   50  30      21         21
1492    273491.6000   38  15      15         24

[528 rows x 5 columns]

In [13]:
sales23.groupby(['ShopID','ShopName','Week'])['SalesMny'].sum().reset_index()

       ShopID                          ShopName  Week   SalesMny
0           1                         Woodhaven     8      2.990
1           1                         Woodhaven     9   6327.982
2           1                         Woodhaven    10   6800.941
3           1                         Woodhaven    11   8258.021
4           1                         Woodhaven    12  17778.261
...       ...                               ...   ...        ...
10487   30332                Blandon Mobile 1-2    23    848.500
10488   30332                Blandon Mobile 1-2    24   2614.500
10489   30332                Blandon Mobile 1-2    25    828.000
10490   31360  1 Lincoln Financial Way-Phila PA    19  16674.500
10491   31360  1 Lincoln Financial Way-Phila PA    21  80115.000

[10492 rows x 4 columns]

In [18]:
os.chdir(r'G:\FinanceReports\2023')
# writer=pd.ExcelWriter('SiteWise Sales by Year.xlsx')
# sales23.groupby(['RitasID','Week'])['SalesMny'].sum().reset_index().to_excel(writer, sheet_name='2023',index=False)
# sales22.groupby(['RitasID','Week'])['SalesMny'].sum().reset_index().to_excel(writer, sheet_name='2022',index=False)
# sales21.groupby(['RitasID','Week'])['SalesMny'].sum().reset_index().to_excel(writer, sheet_name='2021',index=False)
# writer.save()
# writer.close()

In [28]:
writer2=pd.ExcelWriter('SiteWise Sales by Year v2.xlsx')
group_21.to_excel(writer2, sheet_name='2021')
group_22.to_excel(writer2, sheet_name='2022')
writer2.save()
writer2.close()

C:\Users\jharned\Anaconda3\lib\site-packages\xlsxwriter\workbook.py:339: UserWarning: Calling close() on already closed file.
  warn("Calling close() on already closed file.")